Projecto 3/gsoap-2.8/gsoap/bin/win64/BasicHttpBinding_USCORECCMovelSignature.CCMovelSign.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:ns5="http://schemas.datacontract.org/2004/07/Ama.Structures.CCMovelSignature"
    xmlns:ns4="http://schemas.microsoft.com/2003/10/Serialization/"
    xmlns:ns1="http://tempuri.org/"
    xmlns:ns3="http://Ama.Authentication.Service/"
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:saml1="urn:oasis:names:tc:SAML:1.0:assertion"
    xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
    xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns3:CCMovelSign>
    <ns3:request>
     <!-- extensibility element(s) -->
     <ns5:ApplicationId></ns5:ApplicationId>
     <ns5:DocName></ns5:DocName>
     <ns5:Hash></ns5:Hash>
     <ns5:Pin></ns5:Pin>
     <ns5:UserId></ns5:UserId>
    </ns3:request>
   </ns3:CCMovelSign>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
